app/Controllers/CompanyMasterController.php

     public function show()
{
    // Make sure it's a POST request (recommended for AJAX)
    if ($this->request->getMethod() === 'POST') {
        $companyId = (int) $this->request->getPost('companyid'); // match your AJAX key

        if (!$companyId) {
            return $this->response->setJSON([
                'status' => false,
                'html' => '',
                'message' => 'Company ID missing'
            ]);
        }

        $companyModel = new CompanyMasterModel();
        $company = $companyModel->find($companyId);
---
SELECT *
FROM `company_master`
WHERE `company_master`.`id` = 7