app/Controllers/MasterWork.php

            ];

            // Save Data
           $this->WorkMaster->update($id,$work_master_data);
---
UPDATE `work_master` SET `service_code` = 'GST023', `service_name` = 'GST return filling', `sac_code` = '998301', `unit` = 'RETURN', `default_rate` = '26000.00', `gst_percent` = '18.00', `gst_applicable` = 'yes', `frequency` = 'Annually', `status` = 'Active'
WHERE `work_master`.`id` IN ('2')