app/Controllers/MasterWork.php

    public function index()
    {
        $data['workListData'] = $this->WorkMaster->findAll();
---
SELECT *
FROM `work_master`

   public function updateStatus()
{
    $data = $this->request->getJSON(true);

    $status = $data['status'];   // 1 or 0
    $userId = $data['id'];

    $model = new WorkMasterModel();
    $WorkMaster= $model->find($userId);
    if ($model->update($userId, ['status' => $status])) {
---
SELECT *
FROM `work_master`
WHERE `id` = '1'
 LIMIT 1
UPDATE `work_master` SET `status` = 0
WHERE `work_master`.`id` IN ('1')