app/Models/BranchModel.php

    public function findCompanyBranches(int $companyId)
    {
        return $this->where('company_id', $companyId)->findAll();
---
SELECT *
FROM `branches`
WHERE `company_id` = 7